---
type: LinePatternElement
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# LinePatternElement

`Autodesk.Revit.DB.LinePatternElement` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static LinePatternElement Create ( Document document , LinePattern linePattern )` |
| Method | GetLinePattern | — | `` |
| Method | GetLinePattern | 2012 | `public LinePattern GetLinePattern ()` |
| Method | GetLinePatternElementByName | 2012 | `public static LinePatternElement GetLinePatternElementByName ( Document document , string name )` |
| Method | GetSolidPatternId | 2012 | `public static ElementId GetSolidPatternId ()` |
| Method | SetLinePattern | 2012 | `public void SetLinePattern ( LinePattern newLinePattern )` |
| Property | Parameter | — | `` |